app/controllers/pages_controller.rb

SELECT "biens".* FROM "biens" WHERE (biens.latitude IS NOT NULL AND biens.longitude IS NOT NULL)
---
  def home
    @biens = Bien.geocoded #returns flats with coordinates

    @markers = @biens.map do |bien|